In [2]:
import pandas as pd

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [7]:
frame.head

<bound method NDFrame.head of    pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003>

In [9]:
frame = pd.DataFrame(data,columns=['year','pop','state'])
frame

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [14]:
frame.state=='Ohio'

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [15]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])

In [16]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [30]:
import numpy as np
frame2['debt'] = np.arange(6.0)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [19]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [21]:
val = pd.Series([-1.2, -1.5, -1.7,4,5,6,],index=frame2.index)
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  -1.2
two    2001    Ohio  1.7  -1.5
three  2002    Ohio  3.6  -1.7
four   2001  Nevada  2.4   4.0
five   2002  Nevada  2.9   5.0
six    2003  Nevada  3.2   6.0

In [22]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [23]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [24]:
#Reindexing
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [25]:
obj  =  obj.reindex(['a','b','c','d','e'])
obj

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [28]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [29]:
obj3.reindex(range(6),method='ffill')
obj3

0      blue
2    purple
4    yellow
dtype: object

In [41]:
arr = np.arange(9).reshape((3,3))
frame4 = pd.DataFrame(arr,index=['a','b','c'],columns=['prince','ramesh','ram'])
frame4

   prince  ramesh  ram
a       0       1    2
b       3       4    5
c       6       7    8

In [42]:
frame4 = frame4.reindex(['a','c','b','d'])
frame4

   prince  ramesh  ram
a     0.0     1.0  2.0
c     6.0     7.0  8.0
b     3.0     4.0  5.0
d     NaN     NaN  NaN

In [49]:
frame4=frame4.reindex(columns=['ramesh','prince','krishna'],fill_value=)
frame4

   ramesh  prince  krishna
a     1.0     0.0      NaN
c     7.0     6.0      NaN
b     4.0     3.0      NaN
d     NaN     NaN      NaN

In [50]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
         index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [56]:
data.drop(['Ohio','Utah'],inplace=True)

In [57]:
data.drop(columns=['two','four'])

          one  three
Colorado    4      6
New York   12     14

In [58]:
#Indexing 
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
     index=['Ohio', 'Colorado', 'Utah', 'New York'],
     columns=['one', 'two', 'three', 'four'])

In [73]:
data[:]['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [66]:
data[['two','one']]

          two  one
Ohio        1    0
Colorado    5    4
Utah        9    8
New York   13   12

In [74]:
data[data['one']>8]

          one  two  three  four
New York   12   13     14    15

In [75]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [78]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
data.loc['Ohio']

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int32

In [85]:
data.one

Ohio         0
Colorado     0
Utah         8
New York    12
Name: one, dtype: int32

In [86]:
data.iloc[2,[3,0,2]]

four     11
one       8
three    10
Name: Utah, dtype: int32

In [87]:
#Arithmetic 
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
     index=['a', 'c', 'e', 'f', 'g'])

In [88]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [93]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
     index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [95]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [92]:
df1.add(df2,fill_value=0)
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [4]:
import numpy as np
frame5 = pd.DataFrame(np.random.randn(3,4),columns=list('abcd'),index=['hello','hey','hi'])

In [99]:
frame5

              a         b         c         d
hello  0.041486 -0.343056 -1.275331  0.273543
hey    0.097369  0.025323 -0.085550  0.837404
hi    -0.408800  0.480674 -0.750548 -0.666875

In [100]:
np.abs(frame5)

              a         b         c         d
hello  0.041486  0.343056  1.275331  0.273543
hey    0.097369  0.025323  0.085550  0.837404
hi     0.408800  0.480674  0.750548  0.666875

In [103]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])
frame5.apply(f)

            a         b         c         d
min -0.408800 -0.343056 -1.275331 -0.666875
max  0.097369  0.480674 -0.085550  0.837404

In [107]:
format = lambda x : '%.2f' % x
frame5['d'].map(format)

hello     0.27
hey       0.84
hi       -0.67
Name: d, dtype: object

In [108]:
obj4 = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj4.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [9]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df.loc['b']

          0         1         2
b  0.098348  0.588079  1.583444
b -0.088755 -0.005078  1.803633

In [12]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
     [np.nan, np.nan], [0.75, -1.3]],
     index=['a', 'b', 'c', 'd'],
     columns=['one', 'two'])
df.sum()

one    9.25
two   -5.80
dtype: float64

In [18]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [19]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [22]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
    for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
    for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
    for ticker, data in all_data.items()})

In [24]:
returns = price.pct_change()
print(returns.tail)

<bound method NDFrame.tail of                 AAPL      GOOG       IBM      MSFT
Date
2009-12-31       NaN       NaN       NaN       NaN
2010-01-04  0.015565  0.010920  0.011841  0.015420
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001848 -0.023279 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
2010-01-11 -0.008822 -0.001512 -0.010470 -0.012720
2010-01-12 -0.011375 -0.017684  0.007955 -0.006607
2010-01-13  0.014106 -0.005741 -0.002145  0.009312
2010-01-14 -0.005792  0.004701  0.015972  0.020099
2010-01-15 -0.016712 -0.016699 -0.004006 -0.003230
2010-01-19  0.044238  0.013138  0.017908  0.007777
2010-01-20 -0.015392 -0.012270 -0.028999 -0.016399
2010-01-21 -0.017286  0.004428 -0.009597 -0.018960
2010-01-22 -0.049599 -0.056554 -0.027132 -0.034988
2010-01-25  0.026903 -0.018200  0.004940  0.012431
2010-01-26  0.014133  0.004481 -0.002934  0.006139
2010-01-27  0.009420 -0.000590  0.004612  0.005763
2010-01-28 -0.041322 -0.014407 -0.020423 -0.017189
2010-01-29 -0.036279 -0.008142 -0.010990 -0.033608
2010-02-01  0.013902  0.005812  0.018629  0.008162
2010-02-02  0.005803 -0.003565  0.006898  0.001760
2010-02-03  0.017206  0.018263  0.001036  0.005973
2010-02-04 -0.036038 -0.025961 -0.021168 -0.027593
2010-02-05  0.017755  0.008562  0.004227  0.006466
2010-02-08 -0.006855  0.004103 -0.008864 -0.010707
2010-02-09  0.010663  0.005567  0.010912  0.010462
2010-02-10 -0.005454 -0.003710 -0.003246 -0.000714
2010-02-11  0.018194  0.003649  0.007492  0.004645
2010-02-12  0.008607 -0.006115  0.002182 -0.006757
...              ...       ...       ...       ...
2019-05-16 -0.004400  0.012687  0.011012  0.023092
2019-05-17 -0.005682 -0.014148 -0.011481 -0.006670
2019-05-20 -0.031270 -0.020176  0.005956 -0.014445
2019-05-21  0.019171  0.009466  0.009843  0.005387
2019-05-22 -0.020472  0.001557 -0.000733  0.006068
2019-05-23 -0.017070 -0.009249 -0.029043 -0.011671
2019-05-24 -0.003841 -0.006399 -0.000831  0.000475
2019-05-28 -0.004135  0.000600 -0.013759 -0.000634
2019-05-29 -0.004769 -0.015598 -0.005902 -0.009670
2019-05-30  0.005187  0.001335 -0.000925  0.006323
2019-05-31 -0.018116 -0.012809 -0.019912 -0.016305
2019-06-03 -0.010110 -0.061071  0.010080 -0.031048
2019-06-04  0.036584  0.016232  0.034459  0.027704
2019-06-05  0.016143 -0.010284 -0.009044  0.021679
2019-06-06  0.014682  0.002034  0.005552  0.015815
2019-06-07  0.026617  0.020779  0.008244  0.028008
2019-06-10  0.012779  0.013452  0.010727  0.009133
2019-06-11  0.011580 -0.001537  0.008980 -0.003771
2019-06-12 -0.003183 -0.001567 -0.007944 -0.004618
2019-06-13 -0.000206  0.010900  0.006599  0.006312
2019-06-14 -0.007262 -0.003141 -0.004493  0.000982
2019-06-17  0.005967  0.006588 -0.001480  0.003020
2019-06-18  0.023518  0.010160  0.010597  0.017388
2019-06-19 -0.002923 -0.001151  0.005133  0.003921
2019-06-20  0.008036  0.008246  0.012912  0.009286
2019-06-21 -0.003409  0.009411  0.002521  0.000146
2019-06-24 -0.001006 -0.005669  0.001078  0.005914
2019-06-25 -0.015158 -0.026149 -0.007104 -0.031572
2019-06-26  0.021629 -0.006029  0.001156  0.003747
2019-06-27 -0.000300 -0.003510  0.000000  0.001643

[2388 rows x 4 columns]>